T = int(input())
for _ in range(T):
    x, y = map(int, input().split())
    cnt = 0 #몇번 움직여야 하는지(결과)
    distance = 0 #현재 지나온 거리
    turn = 0 #해당 턴을 몇번 유지할지
    while distance<y-x:
        cnt+=1
        if cnt%2 == 1:
            turn+=1
        distance += turn
    print(cnt)


# 1: 1 -> 1
# 2: 1 1 -> 2
# 3: 1 1 1 -> 3
# 4: 1 2 1 -> 3
# 5: 1 2 1 1 -> 4
# 6: 1 2 2 1 -> 4
# 7: 1 2 2 1 1 -> 5
# 8: 1 2 2 2 1 -> 5
# 9: 1 2 3 2 1 -> 5
# 10: 1 2 3 2 1 1 -> 6
# 11: 1 2 3 2 2 1 -> 6
# 12: 1 2 3 3 2 1 -> 6
# 13: 1 2 3 3 2 1 1 -> 7
# 14: 1 2 3 3 2 2 1 -> 7
# 15: 1 2 3 3 3 2 1 -> 7
# 16: 1 2 3 4 3 2 1 -> 7
# 17: 1 2 3 4 3 2 1 1 -> 8